Repository: jojojox2/detalluz
Catalog: apps/detalluz-app/src/locales/messages.*.xlf
Languages: es

# detalluz-app.menu.homepage
source: Homepage
es: Inicio

# detalluz-app.menu.invoice-simulator
source: Invoice simulator
es: Simulador de facturas

# detalluz-app.menu.info
source: Info
es: Información

# homepage.welcome-message
source: Welcome to Detalluz!
es: ¡Bienvenido a Detalluz!

# homepage.summary
source: In this app you can check the prices of electricity in Spain for the PVPC (regulated rate).
es: En esta app puedes comprobar los precios de la electricidad en España para la tarifa regulada PVPC.

# homepage.registered-usage
source: If you are registered in the <a href="https://www.i-de.es/" target="_blank">i-DE</a> website, you can use the same credentials in this app to get a simulation of your electricity invoice, with the dates that you prefer.
es: Si estás registrado en la página web de <a href="https://www.i-de.es/" target="_blank">i-DE</a>, puedes utilizar las mismas credenciales en esta app para obtener una simulación de factura, para las fechas que desees.

# homepage.invoice-simulator-button
source: Go to the invoice simulator
es: Ir al simulador

# homepage.check-prices
source: You can also only check and compare PVPC prices of a period:
es: También puedes simplemente ver y comparar los precios PVPC en un periodo:

# homepage.generic-error
source: Oops! An unexpected error occurred... Please try again later
es: ¡Ups! Ha surgido un error inesperado... Por favor reinténtalo más tarde

# info.personal-use
source: This application was designed only for personal use.
es: Esta aplicación ha sido diseñada para uso exclusivamente personal.

# info.scope-ide
source: The scope of it is limited only to already registered users for the <a href="https://www.i-de.es/" target="_blank">i-DE</a> company (electrical distributor in Spain), with no relations or vinculations whatsover with this company. <br /> The credentials used in this application are only to login to these external services, and are <b>not stored</b> in any server, database or similar storage, beyond the session in your own private browser. <br /> The information retrieved are limited to the hourly consumption as detected by your electricity meter.
es: El alcance de la app está limitado únicamente a usuarios registrados en la web de <a href="https://www.i-de.es/" target="_blank">i-DE</a> (compañía distribuidora de electricidad en España), sin ningún tipo de relación o vinculación con dicha empresa. <br /> Las credenciales utilizadas en esta aplicación son únicamente utilizadas para conectarse a sus servicios, y <b>no se almacenan</b> en ningún servidor, base de datos o almacenamiento similar, más allá del propio navegador del usuario para mantener la sesión iniciada. <br /> La información recogida de dichos servicios se limita al consumo por día y hora, recogida por el tu contador de electricidad.

# info.scope-ree
source: The hourly pricing used in this application is retrieved online from the <a href="https://www.esios.ree.es/es/pvpc" target="_blank" >Red Eléctrica de España</a > website.
es: El precio por hora utilizado en esta aplicación se recoge de forma online desde la págiona web de la <a href="https://www.esios.ree.es/es/pvpc" target="_blank" >Red Eléctrica de España</a >.

# info.source-code
source: The source code for this application can be found in <a href="https://github.com/jojojox2/detalluz" target="_blank">GitHub</a>.
es: El código fuente de esta página web se peude encontrar en <a href="https://github.com/jojojox2/detalluz" target="_blank">GitHub</a>.

# info.created-by
source: Created by <b><i>jojojox2</i></b>
es: Creado por <b><i>jojojox2</i></b>

# invoice-simulator.tabs.fixed-price
source: Fixed price
es: Precio fijo

# invoice-simulator.check-hourly-details
source: You can also check the hourly detailed consumption and PVPC electricity price:
es: También puedes comprobar el consumo y precio detallado por horas:

# invoice-simulator.panels.consumption
source: Consumption
es: Consumo

# invoice-simulator.panels.prices
source: Prices
es: Precios

# invoice-simulator.login-warning
source: You must <a [routerLink]="loginLink" [relativeTo]="loginLinkRelative" class="login-link" >login</a > in order to get an invoice simulation
es: Debes <a [routerLink]="loginLink" [relativeTo]="loginLinkRelative" class="login-link" >iniciar sesión</a > para poder obtener una simulación de factura

# invoice-simulator.generic-error
source: Oops! An unexpected error occurred... Please try again later
es: ¡Ups! Ha surgido un error inesperado... Por favor reinténtalo más tarde

# dayjs.cannot-format
source: Cannot format invalid date
es: Formato de fecha no soportado

# datetime-values-table.date-header
source: Date
es: Fecha

# datetime-values-table.mean-footer
source: Mean
es: Media

# datetime-values-table.sum-footer
source: Sum
es: Suma

# datetime-values-table.sum-header
source: Sum
es: Suma

# datetime-values-table.mean-header
source: Mean
es: Media

# invoice-configuration.peak-hired-power.label
source: Peak power
es: Potencia pico

# invoice-configuration.validation-errors.peak-hired-power.required
source: Peak power is required
es: Potencia pico obligatoria

# invoice-configuration.validation-errors.peak-hired-power.min
source: Value cannot be negative
es: El valor no puede ser negativo

# invoice-configuration.validation-errors.peak-hired-power.max
source: Power must be below 10 kW
es: La potencia no puede exceder los 10 kW

# invoice-configuration.link-icon.aria-label
source: Link power values
es: Vincular potencia

# invoice-configuration.valley-hired-power.label
source: Valley power
es: Potencia valle

# invoice-configuration.validation-errors.valley-hired-power.required
source: Valley power is required
es: Potencia valle obligatoria

# invoice-configuration.validation-errors.valley-hired-power.min
source: Value cannot be negative
es: El valor no puede ser negativo

# invoice-configuration.validation-errors.valley-hired-power.max
source: Power must be below 10 kW
es: La potencia no puede exceder los 10 kW

# fixed-price-invoice-detail.title
source: Fixed price Invoice simulation
es: Simulación de factura con precio fijo

# fixed-price-invoice-detail.meter-rental
source: Meter rental
es: Alquiler del contador

# fixed-price-invoice-detail.total-amount
source: Total amount
es: Importe total

# fixed-price-invoice-detail.vat
source: VAT
es: IVA

# fixed-price-invoice-detail.invoice-total-amount
source: Invoice total amount
es: Importe total de la factura

# fixed-price-invoice-detail.power-costs
source: Power costs
es: Costes de potencia

# fixed-price-invoice-detail.hired-power-amount
source: Amount for hired power
es: Importepor potencia contratada

# fixed-price-invoice-detail.energy-costs
source: Energy costs
es: Costes de energía

# fixed-price-invoice-detail.consumed-energy-cost
source: Consumed energy cost
es: Importe por energía consumida

# fixed-price-invoice-detail.community-electricity-tax
source: Minimum community electricity tax
es: Impuesto eléctrico mínimo comunitario

# invoice-detail.subtitle
source: From {{ range?.initDate?.format("LL") }} until {{ range?.endDate?.format("LL") }} <i>({{ invoiceDays }} days)</i>
es: Desde {{ range?.initDate?.format("LL") }} hasta {{ range?.endDate?.format("LL") }} <i>({{ invoiceDays }} días)</i>

# invoice-detail.title
source: Invoice detail
es: Desglose de factura

# invoice-detail.power-period.p1-peak
source: P1 (peak)
es: P1 (pico)

# invoice-detail.power-period.p2-valley
source: P2 (valley)
es: P2 (valle)

# invoice-detail.energy-period.p1-peak
source: P1 (peak)
es: P1 (pico)

# invoice-detail.energy-period.p2-flat
source: P2 (flat)
es: P2 (llano)

# invoice-detail.energy-period.p3-valley
source: P3 (valley)
es: P3 (valle)

# invoice-detail.day
source: day
es: día

# invoice-detail.days
source: days
es: días

# pvpc-invoice-detail.title
source: PVPC Invoice simulation
es: Simulación de factura con tarifa PVPC

# pvpc-invoice-detail.electricity-tax
source: Electricity tax
es: Impuesto de electricidad

# pvpc-invoice-detail.meter-rental
source: Meter rental
es: Alquiler del contador

# pvpc-invoice-detail.total-amount
source: Total amount
es: Importe total

# pvpc-invoice-detail.vat
source: VAT
es: IVA

# pvpc-invoice-detail.invoice-total-amount
source: Invoice total amount
es: Importe total de la factura

# pvpc-invoice-detail.power-costs
source: Power costs
es: Costes de potencia

# pvpc-invoice-detail.power-distribution-tolls
source: Distribution tolls
es: Peajes de transporte y distribución de potecia

# pvpc-invoice-detail.power-charges
source: Power charges
es: Cargos de potencia

# pvpc-invoice-detail.marketing-margin
source: Marketing margin
es: Margen de comercialización

# pvpc-invoice-detail.energy-costs
source: Energy costs
es: Costes de energía

# pvpc-invoice-detail.energy-tolls
source: Transport tolls and energy distribution
es: Peajes de transporte y distribución de energía

# pvpc-invoice-detail.energy-charges
source: Energy charges
es: Cargos de energía

# pvpc-invoice-detail.consumed-energy-cost
source: Consumed energy cost
es: Coste de la energía consumida

# login.dialog.title
source: Login
es: Iniciar sesión

# login.email.placeholder
source: Enter your email
es: Introduce tu email

# login.validation-errors.email.required
source: Email is required
es: Email obligatorio

# login.validation-errors.email.invalid
source: Invalid email
es: Email no válido

# login.password
source: Password
es: Contraseña

# login.password.placeholder
source: Enter your password
es: Introduce tu contraseña

# login.validation-errors.password.required
source: Password is required
es: Contraseña obligatoria

# login.validation-errors.invalid-credentials
source: Invalid email and/or password
es: Email y/o contraseña inválidos

# login.remember-me
source: Keep logged in
es: Mantener sesion iniciada

# login.cancel-button
source: Cancel
es: Cancelar

# login.login-button
source: Login
es: Iniciar sesión

# range-selector.label
source: Enter a date range
es: Rango de fechas

# range-selector.start-date
source: Start date
es: Inicio

# range-selector.end-date
source: End date
es: Fin

# range-selector.validation-errors.start-date.required
source: Start date is required
es: Fecha inicio obligatoria

# range-selector.validation-errors.start-date.invalid
source: Invalid start date
es: Fecha inicio no válida

# range-selector.validation-errors.end-date.required
source: End date is required
es: Fecha fin obligatoria

# range-selector.validation-errors.end-date.invalid
source: Invalid end date
es: Fecha fin no válida

# range-selector.validation-errors.invalid-range
source: Invalid range
es: Rango inválido

# range-selector.search-button
source: Search
es: Buscar

# toolbar.menu-icon.aria-label
source: Menu
es: Menú

# toolbar.language-icon.aria-label
source: Select language
es: Selecciona idioma

# toolbar.user-icon.aria-label
source: User actions
es: Acciones de usuario

# toolbar.login
source: Login
es: Iniciar sesión

# toolbar.logout
source: Logout
es: Cerrar sesión
